# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks.azurerm_kubernetes_cluster.aks has changed
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      ~ kube_admin_config                   = (sensitive value)
        name                                = "corr-at22-aks"
        tags                                = {}
        # (35 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      ~ kubernetes_version                  = "1.32.7" -> "1.32"
        name                                = "corr-at22-aks"
        tags                                = {}
        # (35 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "syspool"
          ~ orchestrator_version          = "1.32.7" -> "1.32"
            tags                          = {}
            # (29 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.workpool will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "workpool" {
        id                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks/agentPools/workpool"
        name                          = "workpool"
      ~ orchestrator_version          = "1.32.7" -> "1.32"
        tags                          = {}
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infra-resources.azapi_resource.lakmus is tainted, so must be replaced
-/+ resource "azapi_resource" "lakmus" {
      ~ id                        = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/lakmus" -> (known after apply)
        name                      = "lakmus"
      ~ output                    = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be updated in-place
  ~ resource "azurerm_key_vault" "obs_kv" {
        id                              = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-corr-at22-B5W6pl"
        name                            = "obs-corr-at22-B5W6pl"
        tags                            = {}
      ~ tenant_id                       = (sensitive value)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role must be replaced
-/+ resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-corr-at22-B5W6pl/providers/Microsoft.Authorization/roleAssignments/14660e1e-e0e2-bf93-d3f8-8ddbc5fa4956" -> (known after apply)
      ~ name                                   = "14660e1e-e0e2-bf93-d3f8-8ddbc5fa4956" -> (known after apply)
      ~ principal_id                           = "cc75a1cc-d6a1-4530-828f-86832ce91b9b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.observability.azurerm_role_assignment.kv_reader_lakmus must be replaced
-/+ resource "azurerm_role_assignment" "kv_reader_lakmus" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleAssignments/15fa2a4d-bf14-9b90-780a-e8d844c0d5d6" -> (known after apply)
      ~ name                                   = "15fa2a4d-bf14-9b90-780a-e8d844c0d5d6" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/21090545-7ca7-4776-b22c-e363652d74d2" -> (known after apply)
      ~ scope                                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |